tests/auto_build/testcases/output/ValidXMLCharIsInterpretedAsCPPCommand_Request.expected

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 816

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test1Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg.WithADot>1</ns2:arg.WithADot>
<ns2:arg_WithAnUnderscore>2</ns2:arg_WithAnUnderscore>
<ns2:arg-WithAHyphen>3</ns2:arg-WithAHyphen>
<ns2:arg:WithAColon>4</ns2:arg:WithAColon>
<ns2:arg__WithTwoUnderscores>5</ns2:arg__WithTwoUnderscores>
<ns2:arg.With.TwoDots>6</ns2:arg.With.TwoDots>
<ns2:arg..WithTwoDotsInline>7</ns2:arg..WithTwoDotsInline>
</ns1:Element>
</ns1:test1Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /axis/ValidXMLCharIsInterpretedAsCPPCommand HTTP/1.1
Host: 127.0.0.1:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "ValidXMLCharIsInterpretedAsCPPCommand#test1"
Content-Length: 816

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:test1Request xmlns:ns1="http://localhost/axis/ValidXMLCharIsInterpretedAsCPPCommand">
<ns1:Element xmlns:ns2="ValidXMLCharIsInterpretedAsCPPCommandTypes"><ns2:arg.WithADot>1</ns2:arg.WithADot>
<ns2:arg_WithAnUnderscore>2</ns2:arg_WithAnUnderscore>
<ns2:arg-WithAHyphen>3</ns2:arg-WithAHyphen>
<ns2:arg:WithAColon>4</ns2:arg:WithAColon>
<ns2:arg__WithTwoUnderscores>5</ns2:arg__WithTwoUnderscores>
<ns2:arg.With.TwoDots>6</ns2:arg.With.TwoDots>
<ns2:arg..WithTwoDotsInline>7</ns2:arg..WithTwoDotsInline>
</ns1:Element>
</ns1:test1Request>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

